In [2]:
import pandas as pd

In [3]:
data = {"Name":["N1","N2",'N3',"N1","N4","N1"],
       "Age":[20,21,22,20,23,20],
       "City":["A","B","C","A","D","A"]}
df = pd.DataFrame(data)
df

  Name  Age City
0   N1   20    A
1   N2   21    B
2   N3   22    C
3   N1   20    A
4   N4   23    D
5   N1   20    A

In [19]:
#Identify duplicates
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [5]:
#display duplicate rows
df[df.duplicated()==True]

  Name  Age City
3   N1   20    A
5   N1   20    A

In [11]:
#drop duplicates keeping the last occurence
df.drop_duplicates(keep="last")

  Name  Age City
1   N2   21    B
2   N3   22    C
4   N4   23    D
5   N1   20    A

In [14]:
#drop duplicates removing all duplicates
df.drop_duplicates(keep=False)

  Name  Age City
1   N2   21    B
2   N3   22    C
4   N4   23    D

In [16]:
# drop duplicates based on specific columns
df.drop_duplicates(subset="Age")

  Name  Age City
0   N1   20    A
1   N2   21    B
2   N3   22    C
4   N4   23    D

In [17]:
# drop duplicates based on specific columns
df.drop_duplicates(subset="City")

  Name  Age City
0   N1   20    A
1   N2   21    B
2   N3   22    C
4   N4   23    D

In [18]:
df.duplicated().sum()

2

In [31]:
import numpy as np
df2 = df.drop_duplicates(subset="Age",keep=False)
print(np.array(df2["Age"]))

[21 22 23]

## 2) 5-Fold Cross-Validation

In [44]:
from sklearn.model_selection import KFold

In [45]:
df3 = pd.read_csv("btissue.csv")
df3

,I0,PA500,HFS,DA,Area,A/DA,Max IP,DR,P,class
0,524.794072,0.187448,0.032114,228.800228,6843.598481,29.910803,60.204880,220.737212,556.828334,car
1,330.000000,0.226893,0.265290,121.154201,3163.239472,26.109202,69.717361,99.084964,400.225776,car
2,551.879287,0.232478,0.063530,264.804935,11888.391830,44.894903,77.793297,253.785300,656.769449,car
3,380.000000,0.240855,0.286234,137.640111,5402.171180,39.248524,88.758446,105.198568,493.701814,car
4,362.831266,0.200713,0.244346,124.912559,3290.462446,26.342127,69.389389,103.866552,424.796503,car
...,...,...,...,...,...,...,...,...,...,...
101,2000.000000,0.106989,0.105418,520.222649,40087.920980,77.059161,204.090347,478.517223,2088.648870,adi
102,2600.000000,0.200538,0.208043,1063.441427,174480.476200,164.071543,418.687286,977.552367,2664.583623,adi
103,1600.000000,0.071908,-0.066323,436.943603,12655.342130,28.963331,103.732704,432.129749,1475.371534,adi
104,2300.000000,0.045029,0.136834,185.446044,5086.292497,27.427344,178.691742,49.593290,2480.592151,adi
105,2600.000000,0.069988,0.048869,745.474369,39845.773700,53.450226,154.122604,729.368395,2545.419744,adi

In [47]:
kf = KFold(n_splits=5,shuffle=True,random_state=123)
for fold, (trainIndex,testIndex) in enumerate(kf.split(df3)):
    print(f"Fold Number {fold}")
    print(f"Train indices: {trainIndex}")
    print(f"Test indices: {testIndex}")

Fold Number 0
Train indices: [  1   2   3   6   7   9  10  11  12  14  15  16  17  18  19  20  21  22
  25  26  27  29  30  32  33  34  35  36  37  39  40  43  44  45  46  47
  48  49  51  52  54  55  56  57  58  59  60  61  64  65  66  67  68  69
  70  71  73  74  75  76  77  78  79  80  81  82  83  84  86  88  89  91
  92  94  95  96  97  98 100 101 102 103 104 105]
Test indices: [ 0  4  5  8 13 23 24 28 31 38 41 42 50 53 62 63 72 85 87 90 93 99]
Fold Number 1
Train indices: [  0   1   2   3   4   5   6   7   8  10  11  13  14  15  16  17  18  22
  23  24  25  26  27  28  30  31  32  34  36  37  38  39  40  41  42  43
  44  45  46  47  48  49  50  51  52  53  55  56  57  58  61  62  63  64
  66  67  68  69  72  73  74  75  76  78  80  81  83  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 102 105]
Test indices: [  9  12  19  20  21  29  33  35  54  59  60  65  70  71  77  79  82  84
 101 103 104]
Fold Number 2
Train indices: [  0   2   3   4   5   7   8   9  10  12  13  17  18  19  20  21  22  23
  24  25  27  28  29  31  32  33  34  35  36  38  39  40  41  42  46  47
  48  49  50  52  53  54  55  57  58  59  60  61  62  63  64  65  66  67
  68  69  70  71  72  73  77  78  79  80  82  83  84  85  86  87  90  92
  93  94  95  96  97  98  99 100 101 102 103 104 105]
Test indices: [ 1  6 11 14 15 16 26 30 37 43 44 45 51 56 74 75 76 81 88 89 91]
Fold Number 3
Train indices: [  0   1   4   5   6   8   9  11  12  13  14  15  16  17  19  20  21  23
  24  25  26  28  29  30  31  32  33  35  36  37  38  41  42  43  44  45
  46  47  49  50  51  53  54  56  57  59  60  62  63  65  66  68  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  96  97  98  99 100 101 102 103 104]
Test indices: [  2   3   7  10  18  22  27  34  39  40  48  52  55  58  61  64  67  69
  94  95 105]
Fold Number 4
Train indices: [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  18
  19  20  21  22  23  24  26  27  28  29  30  31  33  34  35  37  38  39
  40  41  42  43  44  45  48  50  51  52  53  54  55  56  58  59  60  61
  62  63  64  65  67  69  70  71  72  74  75  76  77  79  81  82  84  85
  87  88  89  90  91  93  94  95  99 101 103 104 105]
Test indices: [ 17  25  32  36  46  47  49  57  66  68  73  78  80  83  86  92  96  97
  98 100 102]

In [48]:
for trainIndex, testIndex in kf.split(df3):
    df3Train = df3.iloc[trainIndex]
    df3Test = df3.iloc[testIndex]

In [51]:
print("Train Index: ",trainIndex,"\n")
print("Test Index: ",testIndex,"\n")

Train Index:  [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  18
  19  20  21  22  23  24  26  27  28  29  30  31  33  34  35  37  38  39
  40  41  42  43  44  45  48  50  51  52  53  54  55  56  58  59  60  61
  62  63  64  65  67  69  70  71  72  74  75  76  77  79  81  82  84  85
  87  88  89  90  91  93  94  95  99 101 103 104 105]

Test Index:  [ 17  25  32  36  46  47  49  57  66  68  73  78  80  83  86  92  96  97
  98 100 102]

In [52]:
df3Train.shape

(85, 10)

In [53]:
df3Test.shape

(21, 10)